src/test/resources/api-response/twint/charge.json

{
  "id": "s-chg-1",
  "isSuccess": true,
  "isPending": false,
  "isResumed": false,
  "isError": false,
  "card3ds": false,
  "redirectUrl": "",
  "message": {
    "code": "COR.000.000.000",
    "merchant": "Transaction succeeded",
    "customer": "Your payments have been successfully processed."
  },
  "amount": "10.0000",
  "currency": "EUR",
  "returnUrl": "https://unzer.com",
  "date": "2023-01-31 04:44:41",
  "resources": {
    "paymentId": "s-pay-290",
    "traceId": "b2f9c67bebafa3cd49b3d50f9ff00639",
    "typeId": "s-twt-6tg6nwdkrcdk"
  },
  "processing": {
    "uniqueId": "31HA07BC8150FAE7F0B65A2095CE0A83",
    "shortId": "5390.6667.9884",
    "traceId": "b2f9c67bebafa3cd49b3d50f9ff00639"
  }
}